# Taps
tap "warrensbox/tap"

# Apps (casks)
cask "1password-cli@beta"
cask "1password@beta"
cask "antigravity"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "linear-linear"
cask "ngrok"
cask "slack"
cask "sublime-text"
cask "tableplus"
cask "whatsapp"

# CLI tools
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "composer"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "go"
brew "opencode"
brew "php@8.3"
brew "php@8.4"
brew "php@8.5"
brew "tailscale"
brew "tmux"
brew "tree"
brew "warrensbox/tap/tfswitch"
